from midiutil.MidiFile import MIDIFile

# 设置音乐参数
tempo = 120  # 设置速度
duration = 1.0  # 设置每个音符的持续时间
volume = 100  # 设置音量

# 定义"天空之城"的音符序列
notes = [64, 67, 69, 71, 69, 67, 64, 64, 67, 69, 71, 36, 71, 67, 64, 64, 67, 69, 71, 69, 67, 64, 64, 67, 69, 71, 36, 71, 67,
         36, 38, 36, 67, 65, 64, 62, 36, 38, 36, 67, 65, 64, 62, 36, 38, 36, 67, 65, 64, 62, 64, 67, 69, 71, 69, 67, 64, 64, 67, 69, 71, 36, 71, 67, 64, 64, 67, 69, 71, 69, 67, 64, 64, 67, 69, 71, 36, 71, 67,
         36, 38, 36, 67, 65, 64, 62, 36, 38, 36, 67, 65, 64, 62, 36, 38, 36, 67, 65, 64, 62,
         62, 65, 67, 69, 67, 65, 62, 62, 65, 67, 69, 71, 67, 62, 62, 65, 67, 69, 67, 65, 62, 62, 65, 67, 69, 71, 67, 62,
         36, 38, 36, 67, 65, 64, 62, 36, 38, 36, 67, 65, 64, 62, 36, 38, 36, 67, 65, 64, 62,
         64, 67, 69, 71, 69, 67, 64, 64, 67, 69, 71, 36, 71, 67, 64, 64, 67, 69, 71, 69, 67, 64, 64, 67, 69, 71, 36, 71, 67,
         36, 38, 36, 67, 65, 64, 62, 36, 38, 36, 67, 65, 64, 62, 36, 38, 36, 67, 65, 64, 62]



# 创建MIDI文件对象
midi = MIDIFile(1)  # 参数1表示只有一个音轨

# 添加音符到MIDI文件
track = 0  # 音轨编号
channel = 0  # 通道编号
time = 0  # 当前时间
for note in notes:
    midi.addNote(track, channel, note, time, duration, volume)  # 添加音符
    time += duration  # 更新时间

# 设置乐谱的速度
midi.addTempo(track, time, tempo)

# 保存生成的音乐为MIDI文件
with open("sky_city.mid", "wb") as output_file:
    midi.writeFile(output_file)
